<?php
// Heading
$_['heading_title']                = 'Playful Sparkle - Google Sitemap';
$_['heading_robotstxt']            = 'Robots.txt';
$_['heading_product']              = 'محصولات';
$_['heading_category']             = 'دسته‌بندی‌ها';
$_['heading_manufacturer']         = 'تولیدکنندگان';
$_['heading_information']          = 'اطلاعات';
$_['heading_getting_started']      = 'شروع به کار';
$_['heading_setup']                = 'راه‌اندازی سایت مپ گوگل';
$_['heading_troubleshot']          = 'رفع مشکلات رایج';
$_['heading_faq']                  = 'پرسش‌های متداول';
$_['heading_contact']              = 'پشتیبانی تماس';

// Text
$_['text_extension']               = 'افزونه‌ها';
$_['text_success']                 = 'موفقیت: شما فید سایت مپ گوگل را ویرایش کرده‌اید!';
$_['text_htaccess_update_success'] = 'موفقیت: فایل .htaccess با موفقیت به‌روزرسانی شد.';
$_['text_edit']                    = 'ویرایش سایت مپ گوگل';
$_['text_clear']                   = 'پاکسازی پایگاه داده';
$_['text_getting_started']         = '<p><strong>بررسی کلی:</strong> سایت مپ گوگل برای OpenCart 3.x با تولید سایت مپ‌های بهینه‌شده XML به بهبود دیده‌شدن فروشگاه شما کمک می‌کند. این سایت مپ‌ها به موتورهای جستجویی مانند گوگل کمک می‌کنند تا صفحات کلیدی سایت شما را ایندکس کرده و رتبه‌بندی موتور جستجو و حضور آنلاین شما را بهبود بخشند.</p><p><strong>نیازمندی‌ها:</strong> OpenCart 3.x، نسخه PHP 7.3 یا بالاتر و دسترسی به <a href="https://search.google.com/search-console/about?hl=en" target="_blank" rel="external noopener noreferrer">کنسول جستجوی گوگل</a> برای ارسال سایت مپ.</p>';
$_['text_setup']                   = '<p><strong>راه‌اندازی سایت مپ گوگل:</strong> سایت مپ خود را برای درج صفحات محصولات، دسته‌بندی‌ها، تولیدکنندگان و اطلاعات تنظیم کنید. با تغییر این گزینه‌ها، نوع صفحات را برای خروجی سایت مپ فعال یا غیرفعال کنید تا محتوای سایت مپ متناسب با نیازها و مخاطبان فروشگاه شما باشد.</p>';
$_['text_troubleshot']             = '<ul><li><strong>افزونه:</strong> مطمئن شوید که افزونه سایت مپ گوگل در تنظیمات OpenCart شما فعال است. اگر این افزونه غیرفعال باشد، خروجی سایت مپ تولید نمی‌شود.</li><li><strong>محصول:</strong> اگر صفحات محصولات در سایت مپ نمایش داده نمی‌شوند، مطمئن شوید که در تنظیمات افزونه فعال هستند و وضعیت محصولات مربوطه روی "فعال" تنظیم شده است.</li><li><strong>دسته‌بندی:</strong> اگر صفحات دسته‌بندی در سایت مپ ظاهر نمی‌شوند، بررسی کنید که دسته‌بندی‌ها در تنظیمات افزونه فعال باشند و وضعیت آنها نیز روی "فعال" تنظیم شده باشد.</li><li><strong>تولیدکننده:</strong> برای صفحات تولیدکنندگان، اطمینان حاصل کنید که در تنظیمات افزونه فعال هستند و وضعیت تولیدکنندگان روی "فعال" تنظیم شده است.</li><li><strong>اطلاعات:</strong> اگر صفحات اطلاعات در سایت مپ نمایش داده نمی‌شوند، مطمئن شوید که در تنظیمات افزونه فعال هستند و وضعیت آنها روی "فعال" قرار گرفته است.</li></ul>';
$_['text_faq']                     = '<details><summary>چگونه سایت مپ خود را به کنسول جستجوی گوگل ارسال کنم؟</summary>در کنسول جستجوی گوگل، به بخش <em>سایت مپ‌ها</em> در منو بروید، آدرس URL سایت مپ (معمولاً /sitemap.xml) را وارد کنید و روی <em>ارسال</em> کلیک کنید. این کار به گوگل اطلاع می‌دهد تا شروع به کرال کردن سایت شما کند.</details><details><summary>چرا سایت مپ برای SEO مهم است؟</summary>یک سایت مپ به موتورهای جستجو راهنمایی می‌کند تا مهم‌ترین صفحات سایت شما را پیدا کنند، که باعث می‌شود محتوای شما را دقیق‌تر ایندکس کنند و می‌تواند به رتبه‌بندی جستجو کمک مثبت کند.</details><details><summary>آیا تصاویر در سایت مپ درج می‌شوند؟</summary>بله، تصاویر توسط این افزونه در سایت مپ تولیدی گنجانده می‌شوند تا موتورهای جستجو بتوانند محتوای تصویری شما را نیز همراه با URL ایندکس کنند.</details><details><summary>چرا سایت مپ به جای <em>priority</em> و <em>changefreq</em> از <em>lastmod</em> استفاده می‌کند؟</summary>گوگل اکنون مقادیر <priority> و <changefreq> را نادیده می‌گیرد و بیشتر بر روی <lastmod> برای به‌روزرسانی محتوا تمرکز دارد. استفاده از <lastmod> کمک می‌کند تا اولویت به‌روزرسانی‌ها مشخص شود.</details>';
$_['text_contact']                 = '<p>برای دریافت پشتیبانی بیشتر، با تیم پشتیبانی ما تماس بگیرید:</p><ul><li><strong>تماس:</strong> <a href="mailto:%s">%s</a></li><li><strong>مستندات:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">مستندات کاربر</a></li></ul>';
$_['text_user_agent_any']          = 'هر عامل کاربری';
$_['text_allowed']                 = 'مجاز: %s';
$_['text_disallowed']              = 'غیرمجاز: %s';

// Tab
$_['tab_general']                  = 'عمومی';
$_['tab_help_and_support']         = 'راهنما و پشتیبانی';
$_['tab_data_feed_url']            = 'آدرس URL فید داده';
$_['tab_data_feed_seo_url']        = 'آدرس URL فید داده بهینه شده برای SEO';

// Entry
$_['entry_status']                 = 'وضعیت';
$_['entry_product']                = 'محصول';
$_['entry_product_images']         = 'خروجی تصاویر محصول';
$_['entry_max_product_images']     = 'حداکثر تصاویر محصول';
$_['entry_category']               = 'دسته‌بندی';
$_['entry_category_images']        = 'خروجی تصاویر دسته‌بندی';
$_['entry_manufacturer']           = 'تولیدکننده';
$_['entry_manufacturer_images']    = 'خروجی تصاویر تولیدکننده';
$_['entry_information']            = 'اطلاعات';
$_['entry_data_feed_url']          = 'آدرس فید داده';
$_['entry_active_store']           = 'فروشگاه فعال';
$_['entry_htaccess_mod']           = 'ویرایش .htaccess';
$_['entry_validation_results']     = 'نتایج اعتبارسنجی';
$_['entry_user_agent']             = 'عامل کاربری';

// Button
$_['button_patch_htaccess']        = 'اعمال تغییرات در .htaccess';
$_['button_validate_robotstxt']    = 'اعتبارسنجی قوانین Robots.txt';

// Help
$_['help_copy']                    = 'کپی کردن آدرس اینترنتی (URL)';
$_['help_open']                    = 'باز کردن آدرس اینترنتی (URL)';
$_['help_product_images']          = 'خروجی گرفتن تصاویر محصول ممکن است در ابتدا زمان پردازش را افزایش دهد (فقط زمانی که تصاویر برای اولین بار پردازش می‌شوند)، و در نتیجه اندازه فایل نقشه سایت XML افزایش می‌یابد.';
$_['help_htaccess_mod']            = 'URL فید داده بهینه شده برای SEO نیاز به ویرایش فایل .htaccess شما دارد. شما می‌توانید کد مورد نیاز را به‌صورت دستی با کپی و چسباندن در فایل .htaccess خود اضافه کنید، یا به‌سادگی بر روی دکمه نارنجی "Patch .htaccess" کلیک کنید تا تغییرات به‌طور خودکار اعمال شود.';

// Error
$_['error_permission']             = 'هشدار: شما مجوز ویرایش فید سایت مپ گوگل را ندارید!';
$_['error_htaccess_update']        = 'هشدار: خطایی در به‌روزرسانی فایل .htaccess رخ داده است. لطفاً مجوزهای فایل را بررسی کرده و دوباره تلاش کنید.';
$_['error_store_id']               = 'هشدار: فرم شامل store_id نیست!';
$_['error_max_product_images_min'] = 'مقدار حداکثر تصاویر محصولات نمی‌تواند کمتر از صفر باشد.';
